alambe94/STM32_Ethernet/STM32_FreeRTOS_TCP_01/Middlewares/Third_Party/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Fxx/NetworkInterface.c
			heth.Init.MACAddr = ( uint8_t * ) FreeRTOS_GetMACAddress();
			heth.Init.RxMode = ETH_RXINTERRUPT_MODE;

			#if( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM != 0 )
			{
				/* using the ETH_CHECKSUM_BY_HARDWARE option:
				both the IP and the protocol checksums will be calculated
				by the peripheral. */
				heth.Init.ChecksumMode = ETH_CHECKSUM_BY_HARDWARE;
			}
			#else
			{
				heth.Init.ChecksumMode = ETH_CHECKSUM_BY_SOFTWARE;
			}
			#endif

			#if( ipconfigUSE_RMII != 0 )
			{
				heth.Init.MediaInterface = ETH_MEDIA_INTERFACE_RMII;
			}
			#else
			{
				heth.Init.MediaInterface = ETH_MEDIA_INTERFACE_MII;
			}
			#endif /* ipconfigUSE_RMII */

			hal_eth_init_status = HAL_ETH_Init( &heth );

			/* Only for inspection by debugger. */
			( void ) hal_eth_init_status;

			/* Set the TxDesc and RxDesc pointers. */
			heth.TxDesc = DMATxDscrTab;
			heth.RxDesc = DMARxDscrTab;

			/* Make sure that all unused fields are cleared. */
			memset( &DMATxDscrTab, '\0', sizeof( DMATxDscrTab ) );
			memset( &DMARxDscrTab, '\0', sizeof( DMARxDscrTab ) );

			/* Initialize Tx Descriptors list: Chain Mode */
			DMATxDescToClear = DMATxDscrTab;

			/* Initialise TX-descriptors. */
			prvDMATxDescListInit();

			/* Initialise RX-descriptors. */
			prvDMARxDescListInit();

			#if( ipconfigUSE_LLMNR != 0 )
			{
				/* Program the LLMNR address at index 1. */
				prvMACAddressConfig( &heth, ETH_MAC_ADDRESS1, ( uint8_t *) xLLMNR_MACAddress );
			}
			#endif

			/* Force a negotiation with the Switch or Router and wait for LS. */
			prvEthernetUpdateConfig( pdTRUE );

			/* The deferred interrupt handler task is created at the highest
			possible priority to ensure the interrupt handler can return directly
			to it.  The task's handle is stored in xEMACTaskHandle so interrupts can
			notify the task when there is something to process. */
			if( xTaskCreate( prvEMACHandlerTask, "EMAC", configEMAC_TASK_STACK_SIZE, NULL, niEMAC_HANDLER_TASK_PRIORITY, &xEMACTaskHandle ) == pdPASS )
			{
				/* The xTXDescriptorSemaphore and the task are created successfully. */
				xMacInitStatus = eMACPass;
			}
			else
			{
				xMacInitStatus = eMACFailed;
			}
		}
	} /* if( xEMACTaskHandle == NULL ) */

	if( xMacInitStatus != eMACPass )
	{
		/* EMAC initialisation failed, return pdFAIL. */
		xResult = pdFAIL;
	}
	else
	{
		if( xPhyObject.ulLinkStatusMask != 0uL )
		{
			heth.Instance->DMAIER |= ETH_DMA_ALL_INTS;
			xResult = pdPASS;
			FreeRTOS_printf( ( "Link Status is high\n" ) ) ;
		}
		else
		{
			/* For now pdFAIL will be returned. But prvEMACHandlerTask() is running
			and it will keep on checking the PHY and set 'ulLinkStatusMask' when necessary. */
			xResult = pdFAIL;
		}
	}
	/* When returning non-zero, the stack will become active and
    start DHCP (in configured) */
	return xResult;
}
/*-----------------------------------------------------------*/

static void prvDMATxDescListInit()
{
ETH_DMADescTypeDef *pxDMADescriptor;
BaseType_t xIndex;

	/* Get the pointer on the first member of the descriptor list */
	pxDMADescriptor = DMATxDscrTab;

	/* Fill each DMA descriptor with the right values */
	for( xIndex = 0; xIndex < ETH_TXBUFNB; xIndex++, pxDMADescriptor++ )
	{
		/* Set Second Address Chained bit */
		pxDMADescriptor->Status = ETH_DMATXDESC_TCH;

		#if( ipconfigZERO_COPY_TX_DRIVER == 0 )
		{
			/* Set Buffer1 address pointer */
			pxDMADescriptor->Buffer1Addr = ( uint32_t )( Tx_Buff[ xIndex ] );
		}
		#endif

		if( heth.Init.ChecksumMode == ETH_CHECKSUM_BY_HARDWARE )
		{
			/* Set the DMA Tx descriptors checksum insertion for TCP, UDP, and ICMP */
			pxDMADescriptor->Status |= ETH_DMATXDESC_CHECKSUMTCPUDPICMPFULL;
		}
		else
		{
			pxDMADescriptor->Status &= ~( ( uint32_t ) ETH_DMATXDESC_CHECKSUMTCPUDPICMPFULL );
		}

		/* Initialize the next descriptor with the Next Descriptor Polling Enable */
		if( xIndex < ETH_TXBUFNB - 1 )
		{
			/* Set next descriptor address register with next descriptor base address */
			pxDMADescriptor->Buffer2NextDescAddr = ( uint32_t ) ( pxDMADescriptor + 1 );
		}
		else
		{
			/* For last descriptor, set next descriptor address register equal to the first descriptor base address */
			pxDMADescriptor->Buffer2NextDescAddr = ( uint32_t ) DMATxDscrTab;
		}
	}

	/* Set Transmit Descriptor List Address Register */
	heth.Instance->DMATDLAR = ( uint32_t ) DMATxDscrTab;
}
/*-----------------------------------------------------------*/

static void prvDMARxDescListInit()
{
ETH_DMADescTypeDef *pxDMADescriptor;
BaseType_t xIndex;
	/*
	 * RX-descriptors.
	 */

	/* Get the pointer on the first member of the descriptor list */
	pxDMADescriptor = DMARxDscrTab;

	/* Fill each DMA descriptor with the right values */
	for( xIndex = 0; xIndex < ETH_RXBUFNB; xIndex++, pxDMADescriptor++ )
	{

		/* Set Buffer1 size and Second Address Chained bit */
		pxDMADescriptor->ControlBufferSize = ETH_DMARXDESC_RCH | (uint32_t)ETH_RX_BUF_SIZE;  

		#if( ipconfigZERO_COPY_RX_DRIVER != 0 )
		{
		/* Set Buffer1 address pointer */
		NetworkBufferDescriptor_t *pxBuffer;

			pxBuffer = pxGetNetworkBufferWithDescriptor( ETH_RX_BUF_SIZE, 100ul );
			/* If the assert below fails, make sure that there are at least 'ETH_RXBUFNB'
			Network Buffers available during start-up ( ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ) */
			configASSERT( pxBuffer != NULL );
			if( pxBuffer != NULL )
			{
				pxDMADescriptor->Buffer1Addr = (uint32_t)pxBuffer->pucEthernetBuffer;
				pxDMADescriptor->Status = ETH_DMARXDESC_OWN;
			}
		}
		#else
		{
			/* Set Buffer1 address pointer */
			pxDMADescriptor->Buffer1Addr = ( uint32_t )( Rx_Buff[ xIndex ] );
			/* Set Own bit of the Rx descriptor Status */
			pxDMADescriptor->Status = ETH_DMARXDESC_OWN;
		}
		#endif

		/* Initialize the next descriptor with the Next Descriptor Polling Enable */
		if( xIndex < ETH_RXBUFNB - 1 )
		{
			/* Set next descriptor address register with next descriptor base address */
			pxDMADescriptor->Buffer2NextDescAddr = ( uint32_t )( pxDMADescriptor + 1 );
		}
		else
		{
			/* For last descriptor, set next descriptor address register equal to the first descriptor base address */
			pxDMADescriptor->Buffer2NextDescAddr = ( uint32_t ) DMARxDscrTab;
		}

